import { ScrollTop, StrongLink, styleCard, header, GrayH5, StyleH5, Pp10, LinkBible, LinkA} from "components/funcConst";
import { Panel } from 'primereact/panel';
import React from "react";
import { Card } from 'primereact/card'


import photo from "pictures/preaching/cristmas.png";
import { Divider } from "primereact/divider";

export default React.memo(() => {
        React.useEffect(() => {
                ScrollTop();
                document.title = 'Джон Пайпер: Гармония Рождества';
        }, []);

        return(
                <div data-aos="fade-right">
                        <Card 
                                header={header} 
                                title='Джон Пайпер: Гармония Рождества' 
                                style={Object.assign(styleCard(photo), {backgroundPositionY: '27 %'})} 
                        ></Card>
                        <Panel style={{padding:0}}>
                        <p><Pp10/>
                                Иисус Христос существовал и до зачатия во чреве Марии. Мы с вами до своего зачатия не существовали.
                        </p>
                        <p><Pp10/>
                        Говоря о нашем появлении в этом мире или говоря об Иоанне 
                        Крестителе, который «был послан от Бога» <LinkBible link='https://bibleonline.ru/bible/rst66/jhn-1.6/' text='(Иоанна 1:6)'/>, мы не имеем в виду, что он или мы 
                        существовали до того, как были сюда посланы. Но с Иисусом было совсем не так. Он сказал: <i>«Я исшел от 
                        Отца и пришел в мир; и опять оставляю мир и иду к Отцу»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/php-2.6-7/' text='(Иоанна 16:28)'/>. Сын Божий избрал быть зачатым во 
                        чреве Марии. Мы с вами не имели выбора быть рожденными как люди – Иисус имел. <i>«Он, по природе Бог, 
                        не держался за равенство с Богом, но добровольно лишился всего, приняв природу раба и человеком родившись. 
                        Он был во всем человеку подобен»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/php-2.6-7/' text='(Филиппийцам 2:6-7)'/>. Будучи Богом, Иисус размышлял о том, что будет делать, 
                        и размышляя, Он «посчитал», что Его равенство с Богом не есть то, за что нужно крепко держаться, – если касаться 
                        вопроса о том, могло ли это равенство помешать Его воплощению. Он «взял» природу раба.
                        </p>
                        <Divider/>
                        <p><Pp10/>
                        <strong>Почему все так произошло?</strong> Бог же мог сотворить и поддерживать Вселенную иным образом.
                        </p>
                        <p><Pp10/>
                        Вот один из самых фундаментальных библейских ответов – «все сходится». Один из самых фундаментальных ответов 
                        таков: потому над Богом и вне Его не существует такой реальности, в которую Богу пришлось бы «подстраиваться», 
                        чтобы жить в гармонии с ее миром. Сам Бог – мерило всего, что правильно, хорошо, истинно и прекрасно. 
                        Поэтому говорить, что Его пути «надлежащие», означает, что они гармонируют с Ним самим. Они 
                        соответствуют, согласуются со всем, чем является Он. В <LinkBible link='https://bibleonline.ru/bible/rst66/heb-2.10/' text='Евреям 2:10'/> сказано, что, основав нашу веру посредством 
                        Христовых страданий, Бог действовал так, как и надлежало Ему действовать. <i>«Ибо надлежало, чтобы Тот, для 
                        Которого все и от Которого все, приводящего многих сынов в славу, вождя спасения их совершил через страдания»</i> 
                        <LinkBible link='https://bibleonline.ru/bible/rst66/heb-2.10/' text='(Евр. 2:10)'/>. Христос стал совершенным Спасителем через страдания. Так и должно было быть. Бог никогда бы не сделал 
                        ничего, что не гармонировало бы с Его замыслами, и никогда не забывал делать то, что Он должен был сделать.
                        </p>
                        <p><Pp10/>
                        Это объясняет ошеломляющие слова семью стихами ниже: <i>«Посему Он должен был во всем уподобиться братиям, 
                        чтобы быть милостивым и верным первосвященником пред Богом, для умилостивления за грехи народа»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/heb-2.17/' text='(Евреям 2:17)'/>. 
                        Должен был? Да. Можно перевести и так: «Поэтому Он был обязан…» (греч. «готхэн офэйлэн»), – не должен ничего делать вне Бога. 
                        Благодаря божественной мудрости, видя, чему надлежало произойти, Он должен был совершить то, к чему Его призвал Отец. Бог 
                        «должен делать» то, что гармонирует с Его замыслами. Не так, как считает человек, а так как считает сам Бог.
                        </p>
                        <p><Pp10/>
                        С 10 по 17 стихи излагается причина, почему Христос пострадал и стал человеком. Это иллюстрация того, что 
                        Воплощению надлежало произойти. Каждая строка 14 и 15 стиха это причина Воплощения и Рождения Иисуса. 
                        <i>«А как дети причастны плоти и крови, то и Он также воспринял оные, дабы смертью лишить силы имеющего 
                        державу смерти, то есть диавола, и избавить тех, которые от страха смерти через всю жизнь были подвержены рабству»</i>.
                        </p>
                        <p><Pp10/>
                        <strong>Во-первых</strong>, Он стал человеком, потому что таковыми являемся мы. Великий замысел Бога – иметь 
                        семью из людей, а они Его дети, и в этой семье Его вечный Сын один из нас и при этом превосходящий 
                        всех: <i>«Ибо кого Он предузнал, тем и предопределил быть подобными образу Сына Своего, дабы Он 
                        был первородным между многими братиями»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/rom-8.29/' text='(Римлянам 8:29)'/>. 
                        <i>«Посему Он должен был во всем уподобиться братиям…»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/heb-2.17/' text='(Евреям 2:17)'/>.
                        </p>
                        <p><Pp10/>
                        <strong>Во-вторых</strong>, Он стал человеком, чтобы умереть. <i>«Он также воспринял оные, дабы смертью…»</i>. Бог, по Своей природе умереть не может. 
                        Но БогоЧеловек, Иисус Христос, смог. Ему надлежало умереть. Поэтому Он стал смертным человеком.
                        </p>
                        <p><Pp10/>
                        <strong>В-третьих</strong>, Христос стал человеком, <i>«дабы смертью лишить силы имеющего державу смерти, то есть диавола»</i>, – 
                        не прекратить его существования, но лишить его способности использовать смерть как осуждение для людей. 
                        Дьявол осуждает только с помощью одного оружия: непрощенного греха. Если бы он мог с успехом обвинять 
                        нас в зале Божьего суда и добиться обвинительного приговора, тогда мы были бы осуждены. Но в смерти Христа Бог 
                        <i>«истребил учением бывшее о нас рукописание, которое было против нас, и Он взял его от среды и пригвоздил ко кресту; 
                        отняв силы у начальств и властей»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/col-2.14-15/' text='(Колоссянам 2:14-15)'/>. Сатана был обезоружен – у него было отнято оружие эффективного 
                        обвинения. Сему славному событию надлежало произойти, дабы враг был уничтожен вот таким образом.
                        </p>
                        <p><Pp10/>
                        Вот <strong>четвертая причина</strong>, согласно которой Сын Божий стал человеком: <i>«избавить тех, которые от страха смерти через 
                        всю жизнь были подвержены рабству»</i>. Поэтому, когда христианин встречается со смертью и смотрит в ее покрытое 
                        мраком лицо, он говорит: <i>«Ад, где твоя победа? Смерть, где твое жало?»</i> <LinkBible link='https://bibleonline.ru/bible/rst66/1co-15.55/' text='(1 Коринфянам 15:55)'/>. Больше нет страха. 
                        И нет уже рабства. Уже сейчас! Отныне и во веки!
                        </p>
                        <p><Pp10/>
                        Наша цель — видеть гармонию всех Божьих путей, соглашаться с Ним, радоваться и сообразовываться с 
                        Его путями. Сын послал Святого Духа <LinkBible link='https://bibleonline.ru/bible/rst66/jhn-15.26/' text='(Иоанна 15:26)'/>, 
                        который дал нам Писание <LinkBible link='https://bibleonline.ru/bible/rst66/2pe-1.21/' text='(2 Петра 1:21)'/>, к тому же Церкви 
                        даны учителя <LinkBible link='https://bibleonline.ru/bible/rst66/1ti-3.2/' text='(1 Тимофея 3:2)'/>. Рождению Христа надлежало произойти, ибо оно совершенным образом воплощает 
                        Божий план! Мы будем жить в вечности, возрастая в способности видеть то, что видит Бог. Чем больше мы понимаем 
                        так, как Христос, тем больше видим красоту небесного мира. Поставьте в новом году цель – стараться видеть гармонию 
                        Божьего пути спасения, радоваться и размышлять над Его Словом!
                        </p>
                        <br/>
                        <Divider/>
                        <br/>
                        <p><Pp10/>
                        Перевод <i>Владимира Михайленко</i>
                        </p>
                        <p><Pp10/>
                        Источник: ieshua.org — <LinkA link='https://ieshua.org/dzhon-pajper-garmoniya-rozhdestva.htm' text='Джон Пайпер: Гармония Рождества'/>
                        </p>

                        </Panel>
                </div>
        )

})