export const ListLink = [
        {
                title: "Книга Судей, разбор", 
                link:"https://www.youtube.com/embed/videoseries?list=PLPwmm_600Yap5ayuzYAvfQQ7UQnG1D9NM", 
                description: "Книга Судей Израилевых — книга, входящая в состав еврейской Библии и Ветхого Завета."},
        {
                title: "Книга послания к Евреям, разбор", 
                link:"https://www.youtube.com/embed/videoseries?list=PLPwmm_600YaqNrn25qFtibc02tcArp01z", 
                description:'I. Превосходство личности Иисуса (1:1 — 4:13) II. Превосходство священства Иисуса (4:14 — 10:18) III. Предостережение и увещания (10:19 — 13:17) IV. Заключительное благословение (13:18−25)'
        },
        {
                title: "Книга Бытие, разбор", 
                link:"https://www.youtube.com/embed/videoseries?list=PLPwmm_600Yaq53XPoa5AL5adG1ULpBIL5",
                description:'Первые пять книг св. Писания Ветхого Завета – Бытие, Исход, Левит, Числ, Второзаконие, написанных Моисеем и составляющих по своему содержанию, как повествующая об основных законах нравственной и гражданской жизни и главных религиозных обрядах ветхозаветных людей, отдел книг законоположительных в своей совокупности называются одним общим названием Пятокнижия.'
        },
]